{
  "sources": [
    {
      "title": "CSS-Tricks",
      "feedUrl": "https://css-tricks.com/feed/",
      "siteUrl": "https://css-tricks.com",
      "articles": [
        {
          "id": "https://css-tricks.com/?p=340136",
          "author": "Chris Coyier",
          "description": "I’ve been thinking about social media images again. You know, the images that (can) show up when you share a link in places like Twitter, Facebook, or iMessage. You’re essentially leaving money on the table without them, because they …\nThe post Auto-Generated Social Media Images appeared first on CSS-Tricks.\nYou can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/auto-generated-social-media-images/",
          "publishedOn": "2021-05-14T20:34:49.000Z",
          "wordCount": 1934,
          "title": "Auto-Generated Social Media Images"
        },
        {
          "id": "https://css-tricks.com/?p=340343",
          "author": "Nathan Babcock",
          "description": "!default is a Sass flag that indicates conditional assignment to a variable — it assigns a value only if the variable was previously undefined or null. Consider this code snippet:\n$variable: 'test' !default;\nTo the Sass compiler, this line …\nThe post Creating Stylesheet Feature Flags With Sass !default appeared first on CSS-Tricks.\nYou can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/creating-stylesheet-feature-flags-with-sass-default/",
          "publishedOn": "2021-05-14T14:14:34.000Z",
          "wordCount": 1344,
          "title": "Creating Stylesheet Feature Flags With Sass !default"
        },
        {
          "id": "https://css-tricks.com/?p=340403",
          "author": "Chris Coyier",
          "description": "Manuel Matuzović goes line-by-line through a boilerplate HTML document. I like it. It’s a good reference and has a lot of the same type of stuff I tend to put in the main HTML template. It makes me think about …\nThe post HTML Boilerplates appeared first on CSS-Tricks.\nYou can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/html-boilerplates/",
          "publishedOn": "2021-05-14T14:13:07.000Z",
          "wordCount": 749,
          "title": "HTML Boilerplates"
        },
        {
          "id": "https://css-tricks.com/?p=340490",
          "author": "Chris Coyier",
          "description": "Chen Hui Jing covers some recent movement in DevTools:\nFirefox’s grid inspector was pretty full-featured from the get-to and released together with CSS grid in Firefox 52. It was constantly improved upon since. Chrome added a basic grid inspector \n…\nThe post DevTools for CSS layouts 2021 edition appeared first on CSS-Tricks.\nYou can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://chenhuijing.com/blog/devtools-for-css-layouts-2021-edition/#%F0%9F%9A%B2",
          "publishedOn": "2021-05-13T23:22:45.000Z",
          "wordCount": 1594,
          "title": "DevTools for CSS layouts 2021 edition"
        },
        {
          "id": "https://css-tricks.com/?p=340573",
          "author": "Chris Coyier",
          "description": "My friends at Sparkbox are doing a survey on design systems, as they do each year. Go ahead and fill it out if you please. Here are the results from last year. In both 2019 and 2020, the vibe was …\nThe post 2021 Design Systems (Survey/Courses) appeared first on CSS-Tricks.\nYou can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/2021-design-systems-survey-courses/",
          "publishedOn": "2021-05-13T22:55:35.000Z",
          "wordCount": 605,
          "title": "2021 Design Systems (Survey/Courses)"
        },
        {
          "id": "https://css-tricks.com/?p=340036",
          "author": "Temani Afif",
          "description": "When dealing with complex CSS animations, there is a tendency to create expansive @keyframes with lots of declarations. There are a couple of tricks though that I want to talk about that might help make things easier, while staying in …\nThe post Advanced CSS Animation Using cubic-bezier() appeared first on CSS-Tricks.\nYou can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/advanced-css-animation-using-cubic-bezier/",
          "publishedOn": "2021-05-13T14:24:42.000Z",
          "wordCount": 2745,
          "title": "Advanced CSS Animation Using cubic-bezier()"
        },
        {
          "id": "https://css-tricks.com/?p=340118",
          "author": "Chris Coyier",
          "description": "Building animations can get complicated, particularly compelling animations where you aren’t just rolling a ball across the screen, but building a scene where many things are moving and changing in concert. When compelling animation is the goal, a timeline GUI …\nThe post SVGator 3.0 Reshapes the Way You Create and Animate SVG With Extensive New Features appeared first on CSS-Tricks.\nYou can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/svgator-3-0-reshapes-the-way-you-create-and-animate-svg-with-extensive-new-features/",
          "publishedOn": "2021-05-13T14:24:35.000Z",
          "wordCount": 986,
          "title": "SVGator 3.0 Reshapes the Way You Create and Animate SVG With Extensive New Features"
        },
        {
          "id": "https://css-tricks.com/?p=339960",
          "author": "Sandrina Pereira",
          "description": "Let’s talk about disabled buttons. Specifically, let’s get into why we use them and how we can do better than the traditional disabled attribute in HTML (e.g. <button disabled> ) to mark a button as disabled.\nThere are lots of …\nThe post Making Disabled Buttons More Inclusive appeared first on CSS-Tricks.\nYou can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/making-disabled-buttons-more-inclusive/",
          "publishedOn": "2021-05-12T14:31:07.000Z",
          "wordCount": 2771,
          "title": "Making Disabled Buttons More Inclusive"
        },
        {
          "id": "https://css-tricks.com/?p=340359",
          "author": "Chris Coyier",
          "description": "Kitty reflected on an ancient blog post here on CSS-Tricks on how to make an animated pie timer. The old technique is still clever. The new technique is equally clever and much easier. I particularly like the steps() animation function…\nThe post CSS Pie Timer Re-Revisited appeared first on CSS-Tricks.\nYou can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/css-pie-timer-re-revisited/",
          "publishedOn": "2021-05-11T22:00:29.000Z",
          "wordCount": 498,
          "title": "CSS Pie Timer Re-Revisited"
        },
        {
          "id": "https://css-tricks.com/?p=340186",
          "author": "Geoff Graham",
          "description": "How many times have you heard that (or even uttered it under your own breath)? I know I’ve heard it in conversations. I also know I’ve wondered the same thing about a product or two — hey, the idea here …\nThe post I could build this during the weekend appeared first on CSS-Tricks.\nYou can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://world.hey.com/joaoqalves/i-could-build-this-during-the-weekend-aa093c5e",
          "publishedOn": "2021-05-11T21:04:32.000Z",
          "wordCount": 1416,
          "title": "I could build this during the weekend"
        },
        {
          "id": "https://css-tricks.com/?p=339138",
          "author": "Una Kravets",
          "description": "Chrome is experimenting with @container, a property within the CSS Working Group Containment Level 3 spec being championed by Miriam Suzanne of Oddbird, and a group of engineers across the web platform. @container brings us the ability to …\nThe post Next Gen CSS: @container appeared first on CSS-Tricks.\nYou can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/next-gen-css-container/",
          "publishedOn": "2021-05-11T14:36:10.000Z",
          "wordCount": 1419,
          "title": "Next Gen CSS: @container"
        },
        {
          "id": "https://css-tricks.com/?p=340106",
          "author": "Chris Coyier",
          "description": "Like Jamstack, Netlify is coining this term.\nIf your reaction is: great, a new thing I need to know about and learn, know that while Distributed Persistent Rendering (DPR) does involve some new things, this is actually a push …\nThe post Distributed Persistent Rendering (DPR) appeared first on CSS-Tricks.\nYou can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/distributed-persistent-rendering-dpr/",
          "publishedOn": "2021-05-11T14:33:10.000Z",
          "wordCount": 1446,
          "title": "Distributed Persistent Rendering (DPR)"
        },
        {
          "id": "https://css-tricks.com/?p=340020",
          "author": "Chris Coyier",
          "description": "This is extremely fun. Jeff Lindsay has created Topframe, and writes:\nAnybody that knows how to mess around with HTML can now mess around with their desktop computing experience. Topframe is an open source tool that lets you \n…\nThe post Topframe appeared first on CSS-Tricks.\nYou can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/topframe/",
          "publishedOn": "2021-05-10T21:14:15.000Z",
          "wordCount": 727,
          "title": "Topframe"
        },
        {
          "id": "https://css-tricks.com/?p=340208",
          "author": "Chris Coyier",
          "description": "I find build tooling endlessly interesting, especially right now as we’re in a juicy next-gen transitional period with players like Vite, wmr, Snowpack, and esbuild. Hugh Haworth has a good run-down of the new players, and we’ve chatted on …\nThe post Migrating from Parcel to Snowpack appeared first on CSS-Tricks.\nYou can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://benfrain.com/migrating-from-parcel-to-snowpack-build-tool-comparison/",
          "publishedOn": "2021-05-10T21:13:23.000Z",
          "wordCount": 2964,
          "title": "Migrating from Parcel to Snowpack"
        },
        {
          "id": "https://css-tricks.com/?p=339203",
          "author": "Ana Tudor",
          "description": "I recently came across an interesting problem. I had to implement a grid of cards with a variable (user-set) aspect ratio that was stored in a --ratio custom property. Boxes with a certain aspect ratio are a classic problem in …\nThe post Variable Aspect Ratio Card With Conic Gradients Meeting Along the Diagonal appeared first on CSS-Tricks.\nYou can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/variable-aspect-ratio-card-with-conic-gradients-meeting-along-the-diagonal/",
          "publishedOn": "2021-05-10T14:13:12.000Z",
          "wordCount": 3158,
          "title": "Variable Aspect Ratio Card With Conic Gradients Meeting Along the Diagonal"
        }
      ]
    },
    {
      "title": "freeCodeCamp.org",
      "feedUrl": "https://www.freecodecamp.org/news/rss/",
      "siteUrl": "https://www.freecodecamp.org/news",
      "articles": [
        {
          "id": "609d63e962ab9107fe5aa2ce",
          "author": "",
          "description": "You may have heard of the term SMTP before, and wondered what it is. SMTP is a common method for handling email messages. Today I am going to explain what SMTP is, and how to use an SMTP provider such as SendGrid to send emails from your address. What Is",
          "link": "https://www.freecodecamp.org/news/what-is-sendgrid-smpt-email-newsletter-tutorial/",
          "publishedOn": "2021-05-14T20:31:30.000Z",
          "wordCount": 1293,
          "title": "What is SendGrid? SMTP Email Newsletter Tutorial"
        },
        {
          "id": "609ea83362ab9107fe5aa920",
          "author": "",
          "description": "Welcome to the React for Beginners guide. It's designed to teach you all the core React concepts that you need to know to start building React applications in 2021. I created this resource to give you the most complete and beginner-friendly path to learn React from the ground up. By",
          "link": "https://www.freecodecamp.org/news/react-for-beginners-cheatsheet/",
          "publishedOn": "2021-05-14T20:17:37.000Z",
          "wordCount": 3252,
          "title": "React for Beginners: Complete React Cheatsheet for 2021"
        },
        {
          "id": "609e8c2162ab9107fe5aa77d",
          "author": "",
          "description": "Have you ever wondered how websites are built and designed? Do you want to learn the art of web development but you're not that tech savvy – yet? Well, then this tutorial is for you. It's an introduction to Web Development for beginners so you can learn the basics even if",
          "link": "https://www.freecodecamp.org/news/web-development-for-beginners-basic-html-and-css/",
          "publishedOn": "2021-05-14T17:13:14.000Z",
          "wordCount": 1598,
          "title": "Web Development for Beginners – Learn Basic HTML and CSS to Build Your First Web Page"
        },
        {
          "id": "609414f32cd0545b5e943526",
          "author": "",
          "description": "If you manage a large community, chances are you need a way to communicate updates to your members quickly and efficiently. An email newsletter can be a very effective way to do so. In this article, I am going to provide some tips and suggestions for maximizing the impact and",
          "link": "https://www.freecodecamp.org/news/how-to-create-an-email-newsletter-design-layout-send/",
          "publishedOn": "2021-05-13T21:19:40.000Z",
          "wordCount": 1733,
          "title": "How to Create an Email Newsletter [2021 Tutorial] – Design, Layout, Send"
        },
        {
          "id": "609952396008950828b3ea8d",
          "author": "",
          "description": "Software development and testing go hand in hand. And in the era of agile software development, with quick releases of small iterations, you should do testing more and more frequently.  In order to perform effective testing, you need to know about the different types of testing and when you should",
          "link": "https://www.freecodecamp.org/news/types-of-software-testing/",
          "publishedOn": "2021-05-13T19:27:45.000Z",
          "wordCount": 1826,
          "title": "What is Software Testing? The 10 Most Common Types of Tests Developers Use in Projects"
        },
        {
          "id": "609bcc6a62ab9107fe5a9f08",
          "author": "",
          "description": "Handling multiple checkboxes in React is completely different from how you use regular HTML checkboxes. So in this article, we'll see how to work with multiple checkboxes in React. You will learn: How to use a checkbox as a Controlled Input in ReactHow to use the array map and reduce",
          "link": "https://www.freecodecamp.org/news/how-to-work-with-multiple-checkboxes-in-react/",
          "publishedOn": "2021-05-13T18:17:49.000Z",
          "wordCount": 1775,
          "title": "React Tutorial – How to Work with Multiple Checkboxes"
        },
        {
          "id": "609ccb0d62ab9107fe5aa0ce",
          "author": "",
          "description": "I was a corporate lawyer for 12 years. I never thought I'd be working at Google as a software engineer, but now I am. And I'm going to share with you ten important lessons I learned during this career transition. I finished law school in Bangalore, India, a year before",
          "link": "https://www.freecodecamp.org/news/from-lawyer-to-google-engineer/",
          "publishedOn": "2021-05-13T16:25:03.000Z",
          "wordCount": 4002,
          "title": "From Lawyer to Engineer at Google – How to Switch Careers and Learn New Skills"
        },
        {
          "id": "5fde208ae6787e09839407c3",
          "author": "",
          "description": "In this free book, we will build two simple projects and deploy them on Netlify. We will use Vue.js as our front-end framework, and use different technologies to build our projects.  If you follow this tutorial to the end, you will build a simplified version of Twitter and a",
          "link": "https://www.freecodecamp.org/news/build-a-portfolio-with-vuejs/",
          "publishedOn": "2021-05-12T20:53:20.000Z",
          "wordCount": 25080,
          "title": "How to Build and Deploy a Portfolio with Vue.js Axios, the GitHub REST API, and Netlify"
        },
        {
          "id": "609c215862ab9107fe5a9fa9",
          "author": "",
          "description": "Kivy is a free and open source Python framework for developing mobile apps and games with a natural user interface. We just released a 5-hour Kivy course on the freeCodeCamp.org YouTube channel. In this Kivy course, you will learn to create games and applications with Python for every platform",
          "link": "https://www.freecodecamp.org/news/use-the-kivy-python-library-to-create-games-and-mobile-apps/",
          "publishedOn": "2021-05-12T18:49:36.000Z",
          "wordCount": 571,
          "title": "Use the Kivy Python Library to Create Games and Mobile Apps"
        },
        {
          "id": "6096aafe2cd0545b5e944430",
          "author": "",
          "description": "When you're scraping data from the web with Python, Selenium will often come up as an helpful tool to use. It was originally designed for automated testing, but its scraping capabilities are impressive, too. This is because Selenium can do things that other libraries or frameworks often can't when collecting",
          "link": "https://www.freecodecamp.org/news/improve-web-scraping-with-selenium/",
          "publishedOn": "2021-05-11T22:53:43.000Z",
          "wordCount": 1358,
          "title": "How to Use Selenium and Python to Scrape Websites More Effectively"
        }
      ]
    },
    {
      "title": "daverupert.com",
      "feedUrl": "https://daverupert.com/atom.xml",
      "siteUrl": "https://daverupert.com",
      "articles": [
        {
          "id": "https://daverupert.com/2021/05/vibe-check-4/",
          "author": null,
          "description": "I turned 41 at the end of April. Another pandemic birthday in the books. This one was special thanks to grandparents coming to visit which allowed my wife and I to escape to a hotel for a night. A small relief to be off parenting duty for ~18 hours after fourteen months of so much parenting. We ate Korean food, drank cocktails, and watched Deadpool in our hotel room. A tranquil birthday.\nApril was a bit of a hangover from March work-wise. My project load carried over and, while they’re all great projects, I…",
          "link": "https://daverupert.com/2021/05/vibe-check-4/",
          "publishedOn": "2021-05-06T22:32:00.000Z",
          "wordCount": 600,
          "title": "Vibe Check №4"
        },
        {
          "id": "https://daverupert.com/2021/04/the-oceanmaker/",
          "author": null,
          "description": "There’s two features I look for in good sci-fi: 1. something I hadn’t imagined before and 2. something that anticipates the automobile, as well as the traffic jam. The YouTube gods smiled up me and surfaced a channel called DUST, a massive collection sci-fi short films. The quality is much better than what you might expect from “free sci-fi” but one of their films, The OceanMaker, is an absolute standout that raptured me and took me somewhere I’ve never been.\nExtrapolating on the near future Water Wars, The…",
          "link": "https://daverupert.com/2021/04/the-oceanmaker/",
          "publishedOn": "2021-04-27T15:06:00.000Z",
          "wordCount": 209,
          "title": "The OceanMaker"
        }
      ]
    }
  ],
  "cliVersion": "1.7.0"
}